[ADD_ABILITY.A_earth_elem_master_Buff H7BaseBuff]
mName="巨石大师"
mTooltip="%stat1 %icon_Movement 移动力。"

[ADD_ABILITY.A_Master_earth_elem H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="巨石大师"
mTooltip="英雄军队中的土元素获得%buff.buff.stat1 %buff.buff.stat1.icon 移动力，并获得%spell3.name能力。"

[ADD_vitality.A_fire_elem_master_Buff H7BaseBuff]
mName="火焰大师"
mTooltip="%stat1 %icon_health 生命值。\n此生物现在攻击3x3区域。"

[ADD_vitality.A_fire_element_master H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火焰大师"
mTooltip="英雄军队中的火元素获得%buff1.buff.stat1 %icon_health 生命值，并攻击3x3区域。"

[ADD_vitality.A_Prime_essence_Buff H7BaseBuff]
mName="本源精华"
mTooltip="%stat1 %icon_health 生命值,\n%stat2 更多最终伤害"

[ADD_vitality.A_Prime_essence_master H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="本源精华"
mTooltip="英雄军队中类型为%icon_prime 本源的生物获得%buff1.buff.stat1 %icon_health 生命值，并造成%buff2.buff.stat2 更多伤害。"

[ADD_vitality.A_water_elem_master_Buff H7BaseBuff]
mName="水流大师"
mTooltip="%stat1 %icon_health 生命值,\n该生物进行满额范围攻击。"

[ADD_vitality.A_Water_element_master H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="水流大师"
mTooltip="英雄军队中的水元素获得%buff1.buff.stat1 %icon_health 生命值，并进行满额范围攻击。"

[Magic_start_cast.A_reflex_fulgurant H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="气流大师"
mTooltip="战斗开始时，所有类型为%icon_air 气的友方生物获得%spell3.name，持续%buff3.buff.durini 回合。"

v1.36 beta

[ADD_vitality.A_Prime_t2_Buff H7BaseBuff]
mName="本源活力"
mTooltip="%Bonus of stat1 %icon_health 生命值。"

[ADD_vitality.A_Prime_t2_master H7HeroAbility]
mName="本源活力"
mTooltip="英雄的本源信徒和本源元素获得%buff1.buff.stat1 %icon_health 生命值。它们在自己的回合结束时恢复%d %icon_health 生命值。"
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""

[ADD_vitality.A_Prime_t3_Buff H7BaseBuff]
mName="元素塑造者活力"
mTooltip="%stat1 %icon_health 生命值奖励。"

[ADD_vitality.A_Prime_t3_master H7HeroAbility]
mName="元素塑造者活力"
mTooltip="英雄的元素教徒和元素塑造者获得%buff1.buff.stat1 %icon_health 生命值。它们同时获得%spell4.name能力，该能力允许它们进行远程反击。"
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""

[CreatureGrowthBonus.A_Air_elem_growth H7HeroAbility]
mName="狂风大师"
mTooltip="总督：城镇控制区域内的气元素产量增加%buff1.buff.stat。"
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""

[CreatureGrowthBonus.A_Air_elem_growth_Buff H7BaseBuff]
mName="水流增益"
mTooltip=""

[CreatureGrowthBonus.A_Earth_elem_growth H7HeroAbility]
mName="岩石大师"
mTooltip="总督：城镇控制区域内的土元素产量增加%buff1.buff.stat。"
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""

[CreatureGrowthBonus.A_Earth_elem_growth_Buff H7BaseBuff]
mName="火焰增益"
mTooltip=""

[CreatureGrowthBonus.A_fee_growth H7HeroAbility]
mName="精灵大师"
mTooltip="总督：城镇控制区域内的精灵和风精灵产量增加%buff1.buff.stat。"
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""

[CreatureGrowthBonus.A_Fee_growth_Buff H7BaseBuff]
mName="火焰增益"
mTooltip=""

[CreatureGrowthBonus.A_fire_elem_growth H7HeroAbility]
mName="烈焰大师"
mTooltip="总督：城镇控制区域内的火元素产量增加%buff1.buff.stat。"
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""

[CreatureGrowthBonus.A_Fire_elem_growth_Buff H7BaseBuff]
mName="火焰增益"
mTooltip=""

[CreatureGrowthBonus.A_water_elem_growth H7HeroAbility]
mName="波浪大师"
mTooltip="总督：城镇控制区域内的水元素产量增加%buff1.buff.stat。"
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""

[CreatureGrowthBonus.A_Water_elem_growth_Buff H7BaseBuff]
mName="水流增益"
mTooltip=""

[Magic_start_cast.A_proliferation_Fee H7HeroAbility]
mName="精灵召唤者"
mTooltip="每当英雄造成伤害时，有%buff1.chance%的几率使精灵和风精灵的队伍数量增加%buff1.buff.special1。"
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""

[Magic_start_cast.A_proliferation_Fee_Buff H7BaseBuff]
mName="精灵召唤者"
mTooltip=""


v1.37

[new_t3_ability_conflux.A_Poisonedarrow H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="淬毒箭矢"
mTooltip="受影响的生物在其回合开始时受到额外伤害。初始为%buff.buff.special.val2 %ICON_DARK 暗影伤害，并且每有一个元素塑造者，每回合增加%buff.buff.special.val2点伤害。\n持续%buff.buff.durini 回合。"

[SpellSpecializations.A_WaterHealing H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="水流疗者"
mTooltip="英雄初始拥有新手级水系魔法技能和法术%spell1.name \n此法术按此魔法派系当前等级的上一级施放。\n在宗师级时施放此法术，获得%stat1 %ICON_MAGIC 魔力。"